#### RevitCommandId Members

---

|  |
| --- |
| RevitCommandId Class   Methods   Properties   See Also |

The  RevitCommandId  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RevitCommandId |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | LookupCommandId | Looks up and retrieves the Revit command id with the given id string. |
| Public method Static member | LookupPostableCommandId | Looks up and retrieves the Revit command id with the given id string. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CanHaveBinding | Indicates whether the command can be assigned a binding to an external add-in. |
| Public property | HasBinding | Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command. |
| Public property | Id | The command id. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | The command name. |

# See Also

RevitCommandId Class

Autodesk.Revit.UI Namespace